[
  {
    "id":1,
    "title": "What is MuleSoft? and advantages",
    "content": "Mulesoft is an integration platform used for connecting data, applications and API's on premises and over the cloud plataform.",
    "point1": "* MuleSoft works on the AnyPoint Connectivity Model which helps in connecting any existing SaaS-based applications or set of APIs through one single API interface.",
    "point2": "*Organizations always want their system to be in sync so that they can operate all together and because of which integration need comes into picture",
    "point3": "<strong>Challenges Before Mulesoft</strong><br>1. Complexity – if system A is connected with B, C and D and if there is a change in A system then all other system need a change",
    "point4": "2. Rigid Architecture – no space for change<br>3. Reliability – if one of the system fail then there is no reliable way of putting that system out of network and all communication with the system will be lost",
    "point5":"4. Tightly Coupled – each system is connected with all other system so change in one system need a change in many different system<br><strong>Advantages</strong><br>1. Remove Earlier complexities <br> 2. Increase customer engagement <br> 3. Improve Agality",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/2017/07/spaghetti-code.png\"> <img src=\"https://eshiasolutions.com/wp-content/uploads/2021/08/What-is-MuleSoft-A-simplified-look.jpg\">"
  },
  {
    "id":2,
    "title": "What is Integration?",
    "content": "Act of bringing smaller components together in order to work as single product",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": ""
  },
  {
    "id":3,
    "title": "What is Middleware?",
    "content": "Where we can host our applications, Mulesoft is a platform/product for middleware needs with in an organization",
    "point1": "Organizations can have multiple applications to run day to day operations",
    "point2": "Organization always wants there system to be in sync so that they can operate all together and because of which integration comes into the picture",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": ""
  },
  {
    "id":4,
    "title": "What is API? (Application Program Interface)",
    "content": "Api is a way for two or more computer programs to communicate with each other. ",
    "point1": "Organizations can have multiple applications to run day to day operations",
    "point2": "Organization always wants there system to be in sync so that they can operate all together and because of which integration comes into the picture",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": ""
  },
  {
    "id":5,
    "title": "What is Mulesoft ESB? (Enterprise service bus)",
    "content": "1. Mule ESB is an middleware tool for integrating various applications together over a bus like architecture ",
    "point1": "2. With the help of ESB architecture we can connect different applications through a communication bus and enabling them to communicate with out depending on one other",
    "point2": "<strong>Tools:</strong><br><strong>Developers</strong>Anypoint Studio along with Maven & Java",
    "point3": "<strong>Admin:</strong>Any Point Tool (web based)",
    "point4": "<strong>Postman:</strong>For Validation of API's",
    "point5":"<strong>Apache Jmeter:</strong> For Performance Testing.",
     "point6":"",
     "image": "<img src=\"https://www.mulesoft.com/sites/default/files/diagram-basic-esb.png\">"
  },
  {
    "id":6,
    "title": "What are business groups (BG)? (Max: 100 can be created)",
    "content": "Business groups used to manage anypoint resources including API's, applications.",
    "point1": "Each Business group has its own set of permissons and roles",
    "point2": "Organized in a hierarchial tree where the top level BG is root",
    "point3": "Each BG you create can have one direct parent and multiple children",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/2015/06/Anypoint_Platform.png\"><img src=\"https://www.caeliusconsulting.com/blogs/wp-content/uploads/2021/03/bg-Step-3.png\">"
  },
    {
    "id":7,
    "title": "What is Runtime Manager? ",
    "content": "With Runtime Manager, you can deploy, manage, and monitor your Mule applications in a sandbox, staging, or production environment from one central location, whether your apps are deployed in the cloud or on-premises.",
    "point1": "<strong>You can use Runtime Manager in these scenarios:</strong> <br> <strong>1. CloudHub:</strong> CloudHub is a complete integration platform as a service (iPaaS) that automatically meets all of your server needs without requiring any configuration or customization, including object store infrastructure, monitoring, troubleshooting, and scheduling. <br> ---->For applications deployed to CloudHub, you can use Insight for analytics and monitoring.",
    "point2": "<strong>3. Hybrid:</strong> Your on-premises Mule servers host your app deployments and you use the Anypoint Platform Runtime Manager cloud console to manage them.",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/rtm-overview.png\">"
  },
   {
    "id":8,
    "title": "Different Enviornment in Runtime Manager? (QA/Preprod)",
    "content": "If you have multiple environments in your organization, you can switch between them. From any application in Anypoint Platform, you can switch to a different environment.",
    "point1": "1. Click the current environment in the top left corner of Runtime Manager.",
    "point2": "2. Select the environment to which you want to switch",
    "point3": "3. Click Switch.",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/managing-deployed-applications-0e10f.png\">"
  },
   {
    "id":9,
    "title": "How to deploy mule apps?",
    "content": "You can deploy mule apps to cloudhub from Anypoing Runtime Manager, AnyPoint Studio, Cloudhub CLI",
    "point1": "<strong>Deploying Mule app through CLI</strong> <br> Enter your username: <mark>anypoint-cli --username=\"user\"</mark>",
    "point2": "<mark>runtime-mgr cloudhub-application deploy myMuleApp /Users/exported-app-folder/my-mule-app.zip<mark>",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/cloudhub-deploy-app.png\">"
  },
   {
    "id":10,
    "title": "What are Servers, Server Groups, and Clusters?",
    "content": "servers, server groups, and clusters that reside on-premises.",
    "point1": "1. After setting up a server, you can add it to a server group or cluster. ",
    "point2": "2. Then, select the server, group, or cluster as the deployment target for your applications.",
    "point3": "3. When using a server group, instances of the applications are completely isolated from each other. In a cluster configuration, the nodes are aware of one another and share common information and synchronize statuses.",
    "point4": "4. All servers in a server group or clusters must have the same Mule runtime engine version and Runtime Manager agent version.",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://blogs.perficient.com/files/2016/04/local-servers.jpg\">"
  },
   {
    "id":11,
    "title": "Different Alerts in Runtime Manager?",
    "content": "You can set up alerts to send email notifications when application or server events occur.",
    "point1": "<mark>Application Deployed / Application Failed</mark>",
    "point2": "<mark>CPU Usage / Memory Usage</mark> is equal or above 80% for atleast 10 Minutes",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
   {
    "id": 12,
    "title": "How to troubleshoot Applications?",
    "content": "You can access information to help you troubleshoot applications using the following tools:",
    "point1": "<strong>Insight:</strong>You can access a dashboard with key metrics and see events at an individual transaction level of detail.",
    "point2": "<strong>API Functional Monitoring:</strong>Using API functional monitoring, you can automate testing and generate reports to verify API functionality and validate the results that the API generates. You can monitor APIs at each stage of the software development life cycle and in production.",
    "point3": "<strong>View Application Log data:</strong>You can access a log of events occurring to your application and the CloudHub workers they run on. <br> For applications deployed to your own servers, you can export log data to third-party software to view there.",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
   {
    "id": 13,
    "title": "What is Cloudhub?",
    "content": "CloudHub is an <mark>&nbsp;integration platform as a service (iPaaS)&nbsp;</mark> where you can deploy applications, integrate on-premises applications with cloud services",
    "point1": "Easy Scalability",
    "point2": "Integration with Anypoint Studio",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
   {
    "id":14,
    "title": "What is a Worker?",
    "content": "Worker is a dedicated instance of mule hosted in AWS to run integrated applications.",
    "point1": "<strong>Features:</strong>",
    "point2": "<strong>1.Capacity:</strong>Each Worker will have a specific amount of capacity to process data. ",
    "point3": "<strong>2.Isolation:</strong>Each worker run in a separate container for each other application. ",
    "point4": "<strong>3.Manageability:</strong> Each worker is deployed and managed independently. ",
    "point5":"<strong>4.Locality:</strong> Each Worker runs in a specific worker cloud such as Asia Specific / US / EU ",
     "point6":"",
     "image": "<img src=\"\">"
  },
   {
    "id":15,
    "title": "What is VCore?",
    "content": "A unit of compute capacity for processing on CloudHub, which is equal to one virtual core.",
    "point1": "<mark>1Vcore - 10 Apps</mark>",
    "point2": "0.1 Vcore - Can be consumed for 1 Mule Application",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/img_6059d59ace619.png\">"
  },
   {
    "id":16,
    "title": "What is Listener?",
    "content": "It enables to setup an http server and trigger flows when receiving http request.",
    "point1": "We can choose what methods that source accept such as GET and POST or a list of methods",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://dz2cdn1.dzone.com/storage/temp/2657609-picture2.png\">"
  }
]